# Summary Functions and Maps

In [2]:
import pandas as pd
titanic = pd.read_csv("../Datasets/titanic.csv")
health = pd.read_csv("../Datasets/Health_heart_experimental.csv")

---
## Summary Functions

there are many summary functions in pandas, some of them are listed below:

Describe() lists outs some of the key attributes of data such as mean, median, total number of data and so on. It is type aware so output changes according to the type of input.

In [5]:
titanic.Name.describe() #String

count                     891
unique                    891
top       Dooley, Mr. Patrick
freq                        1
Name: Name, dtype: object

In [6]:
health.BMI.describe() #Float

count    71760.000000
mean        28.888043
std          6.780976
min         13.000000
25%         24.000000
50%         29.000000
75%         35.000000
max         40.000000
Name: BMI, dtype: float64

We can find the specific summary of the data using functions of pandas. <br>
mean(), median(), unique() and so on are examples of such functions.

* mean() is self explanatory, as it gives the mean of the data.

In [4]:
titanic.Age.mean()

np.float64(29.69911764705882)

* unique() lists out the unique values in the dataset.

In [7]:
titanic.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

* value_counts() is also self explanatory, as it returns the the amount of times a value is repeated.

In [8]:
health.age.value_counts()

age
20    1535
62    1496
30    1495
24    1495
68    1490
25    1489
45    1486
21    1486
64    1485
44    1483
67    1470
66    1469
43    1467
23    1466
29    1457
26    1454
50    1447
56    1447
63    1443
61    1438
49    1435
38    1434
52    1433
58    1432
34    1430
69    1429
36    1428
33    1418
41    1417
60    1417
31    1417
42    1417
22    1414
47    1413
27    1412
39    1410
46    1409
32    1407
35    1405
65    1403
57    1403
53    1400
51    1397
48    1393
28    1383
37    1383
54    1382
55    1381
40    1380
59    1380
Name: count, dtype: int64

---
## Maps

A map in data science is a tool that changes data from one form to another. It helps with tasks like cleaning data, creating new features, or organizing information for better analysis.

* map() is the first, and slightly simpler one. <br>
 For example, suppose that we wanted to remean the ages of the people in titanic to 0. We can do this as follows:

In [9]:
age_mean=titanic.Age.mean()
titanic.Age.map(lambda p: p-age_mean)

0      -7.699118
1       8.300882
2      -3.699118
3       5.300882
4       5.300882
         ...
886    -2.699118
887   -10.699118
888          NaN
889    -3.699118
890     2.300882
Name: Age, Length: 891, dtype: float64

* apply() is the equivalent method if we want to transform a whole DataFrame by calling a custom method on each row.

In [10]:
def remean(row):
    row.Age = row.Age - age_mean
    return row
titanic.apply(remean, axis='columns')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,-7.699118,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,8.300882,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,-3.699118,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,5.300882,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,5.300882,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,-2.699118,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,-10.699118,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,-3.699118,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,2.300882,0,0,370376,7.7500,NaN,Q

Note that map() and apply() return new, transformed Series and DataFrames, respectively. They don't modify the original data they're called on.

---